src/Documents/Переводы/Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Переводы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучатель</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счета</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Переводы/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль объекта документа Переводы.
// Перемещение денег между счетами: только регистр Баланс, без доходов и расходов.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроверитьРеквизитыДокумента(Отказ);
	
	Если Не Отказ Тогда
		
		ПроверитьКурсВалютыОперации(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИндексСуммы = ПроверяемыеРеквизиты.Найти("Сумма");
	
	Если ИндексСуммы <> Неопределено Тогда
		
		ПроверяемыеРеквизиты.Удалить(ИндексСуммы);
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Сумма перевода должна быть больше нуля.", "Сумма");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетИсточник) И СчетИсточник = СчетПолучатель Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Счёт-источник и счёт-получатель должны отличаться.", "СчетПолучатель");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СуммаУчета = ОбщийМодульСервер_КурсыВалют.СуммаВВалютеУчета(Сумма, Валюта, Дата);
	
	Движения.Баланс.Записывать = Истина;
	
	// Списание со счёта-источника
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Счета = СчетИсточник;
	Движение.Сумма = СуммаУчета;
	Движение.ВалютнаяСумма = Сумма;
	
	// Зачисление на счёт-получатель
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Счета = СчетПолучатель;
	Движение.Сумма = СуммаУчета;
	Движение.ВалютнаяСумма = Сумма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет обязательные реквизиты перевода.
//
Процедура ПроверитьРеквизитыДокумента(Отказ)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена дата.", "Дата");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетИсточник) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен счёт-источник.", "СчетИсточник");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетПолучатель) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен счёт-получатель.", "СчетПолучатель");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетИсточник) И СчетИсточник = СчетПолучатель Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Счёт-источник и счёт-получатель должны отличаться.", "СчетПолучатель");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена валюта.", "Валюта");
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Сумма перевода должна быть больше нуля.", "Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКурсВалютыОперации(Отказ)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Валюта = ВалютаУчета Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ОбщийМодульСервер_КурсыВалют.ПолучитьДанныеКурса(Валюта, Дата) = Неопределено Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения(ОбщийМодульСервер_КурсыВалют.ТекстСообщенияОбОтсутствииКурса(Валюта, Дата), "Валюта");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОшибкуЗаполнения(ТекстСообщения, ИмяПоля)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле = ИмяПоля;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
